<template>
	<view>
		<h2>scroll_view</h2>
		<scroll_view style="width: 220px;height: 220px;" scroll-x="true" scroll-y="true" @scrolltoupper="myScrollToUpper()" @scolltolower="myScrollToLower()" scroll-with-animation="true" upper-threshold="200" lower-threshold="200"
		 @scroll="myScroll()">
		 
			滑动区域
			<view>
				<p>钉钉的技术栈继承自阿里巴巴集团。阿里有着”大中台，小前台“的组织战略，所以钉钉在大的框架上是复用集团的能力，包括集团的中间件、存储引擎、微服务框架等。在此之上，钉钉聚焦在核心能力的研发，比如：IM核心系统、系统单元化、音视频通讯，弱网优化，图片收发极致体验等等。钉钉作为 ToB 产品，业务场景跟 ToC 的 IM 产品有很大区别，架构上也各有侧重。</p>
			</view>
			
			<view>
				<p>
					在钉钉里，企业的组织关系映射到 IM 的群，产生了为数众多的超级大群。和 500 群人数上限相比，钉钉支持万人大群，大幅提升了群的触达人数。
				
					如此数目繁多的万人群给 IM 系统的流量冲击巨大。在节假日，特别是元旦、春节或者双 11 这样的重大活动时期，管理层和员工在大群高频互动，流量洪峰瞬间流过 IM 系统，挑战着系统的极限。
				
					为支撑好超级大群，我们做了以下多点的优化。
				
					3.1.1）降低存储扩散量：
				
					最早 IM 使用写扩散模型，一万人的群发一条消息写一万次消息收件箱。优化为读扩散模型后，一条消息只需写一次消息收件箱，扩散量降低到万分之一。
				
					3.1.2）智能限流：
				
					在节日场景下，一些大群的消息发送频率过高，可能超过系统整体容量，影响 IM
					系统稳定性。如果对每个群设置较低的发送阈值，系统又没有完全发挥出容量，从而提供足够流畅的用户体验。针对这个问题，我们设计了一种智能限流的方法，当总体流量超过系统阈值时，自动根据当时情况对消息发送频率相对较高的大群进行限流。
				</p>
			</view>
			
			<p>
				一方面增强了用户打开 at 列表、查看群成员列表的体验。因为群成员人数增大时，
				打开群成员列表的延迟提升明显，用户能感受到长达数十秒的卡顿。增加客户端缓存后，用户输入 @立刻响应成员列表，即使群里有几万个群成员。另一方面避免了大量群成员读写对 DB 的压力。
				如果压力直接打到 DB 层，万行记录的扩散量过大，很容易造成热点，影响系统稳定性。
			</p>
			<h3>钉钉中的历史消息是可回溯的。在 ToB 场景下，数据属于企业的资产。企业有需求查看历史消息，因为它是关键的沟通信息。首先是既省流量，又不遗漏的历史消息回溯协议：最近的消息通过同步协议推送到达客户端本地。而历史的消息，服务端不曾推送，客户端本地没有入库。在用户进入会话时，如果客户端发现本地消息不足，自动从服务端拉取不足的历史消息。采用这种推拉结合的协议，保证了消息不管多么久远，都可以毫无遗漏的从服务端同步下来。</h3>
		</scroll_view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {
			myScrollToUpper: function(e) {
				console.log("myScrollToUpper;e=", e);
			},
			myScrollToLower: function(e) {
				console.log("myScrollToLower;e=", e);
			},
			myScroll: function(e) {
				console.log("myScroll;e=", e);
			}

		}
	}
</script>

<style>

</style>
